app/controllers/apisettings_controller.rb

  def create
    @apisetting = Apisetting.first
    if @apisetting.present?
      @apisetting.update_attributes!(params[:apisetting])
      redirect_to root_url, :notice => "Successfully updated"
    else
      @apisetting = Apisetting.new(params[:apisetting])
      @apisetting.save!
---
SELECT "apisettings".* FROM "apisettings" LIMIT 1
UPDATE "apisettings" SET "list" = 'a1873a9520', "updated_at" = '2013-08-27 13:58:19.499400' WHERE "apisettings"."id" = 1
INSERT INTO "apisettings" ("api_key", "created_at", "list", "updated_at") VALUES (?, ?, ?, ?)  [["api_key", "374e4dc45917b1a48525c8131f276a9d-us6"], ["created_at", Tue, 27 Aug 2013 11:56:27 UTC +00:00], ["list", "bc3804fc1c"], ["updated_at", Tue, 27 Aug 2013 11:56:27 UTC +00:00]]