app/controllers/users_controller.rb

  def index
    #authorize! :index, @user, :message => 'Not authorized as an administrator.'
    @users = User.all
---
SELECT `users`.* FROM `users`

  def update
    authorize! :update, @user, :message => 'Not authorized as an administrator.'
    @user = User.find(params[:id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = 2 LIMIT 1